package lr3;

import java.util.Scanner;

public class Example8 {
    public static void main(String[] args) {
        char[] letters = new char[10];
        char a='A';
        char sogl1 = 'A';
        char sogl2 = 'E';
        char sogl3 = 'I';

        for (char i = 0; i < letters.length; ++i){

        }

    }
}


//    Напишите программу, в которой создается символьный массив из 10 элементов.
//        Массив заполнить большими (прописными) буквами английского алфавита.
//        Буквы берутся подряд, но только согласные
//        (то есть гласные буквы ’ А','Е' и ' I' при присваивании значений элементам массива нужно пропустить).
//        Отобразите содержимое созданного массива в консольном окне.