package lr4;

public class Example2 {
    public static void main(String[] args) {
        int figure = 10;

        for(int i = 1; i<figure;i++) {
            for(int y = i; y<figure; y++){
                System.out.print("+");
            }
            System.out.println();
        }


    }
}

//    Напишите программу, которая выводит в консольное окно
//    прямоугольный треугольник;